In [1]:
import pandas as pd

In [6]:
df_sid = pd.read_csv('./sales_invoice_details.csv', index_col=0)
df_bt = pd.read_csv('./brand_tieup.csv', index_col=0)

df_sid.head()

   billing_user_id  product_id       Month  store_id  bill_amount  quantity
0               40       11376     June-24        39         0.00         1
1               63       11400  October-24       130       609.12         8
2               72       11376     July-24        29       188.00         2

In [7]:
df_bt.head()

         Month  ws_code  Incentive             product_name  product_id
0  February-25    521.0        5.0     AMLIP 2.5MG TAB 1X10       11981
1  February-25    522.0        6.0       AMLIP 5MG TAB 1X10       11982
2  February-25    524.0        7.0  AMLOBET 5/50MG TAB 1X14       11985
3  February-25    533.0        8.0      AMLODOC AT TAB 1X10       11988
4  February-25    527.0        9.0     AMLODAC 5MG TAB 1X30       11989

In [8]:
df_merged = pd.merge(df_sid, df_bt, on=['product_id', 'Month'], how='left')
df_merged

,billing_user_id,product_id,Month,store_id,bill_amount,quantity,ws_code,Incentive,product_name
0,40,11376,June-24,39,0.00,1,NaN,NaN,NaN
1,63,11400,October-24,130,609.12,8,NaN,NaN,NaN
2,72,11376,July-24,29,188.00,2,NaN,NaN,NaN